org/investing_in_etfs.org
#+SETUPFILE:./hugo_setup.org
#+TITLE: Investing In ETFs

* Identifying good ETFs /(Joshua Giersch, Rich By Retirement)/

Good ETFs satisfy the following conditions:

1. Low fees (<0.3% per annum)
2. Plenty of assets in the fund (above $100 million)
3. "Cash" or "physical", not "synthetic"
   1. This is because if the counterparty collapses, the synthetic ETF
      will start tracking the bunch of miscellaneous stocks

