content/posts/investing_in_etfs.md
+++
title = "Investing In ETFs"
author = ["Jethro Kuan"]
lastmod = 2020-05-31T02:52:13+08:00
draft = false
+++

## Identifying good ETFs _(Joshua Giersch, Rich By Retirement)_ {#identifying-good-etfs--joshua-giersch-rich-by-retirement}

Good ETFs satisfy the following conditions:

1.  Low fees (<0.3% per annum)
2.  Plenty of assets in the fund (above \$100 million)
3.  "Cash" or "physical", not "synthetic"
    1.  This is because if the counterparty collapses, the synthetic ETF
        will start tracking the bunch of miscellaneous stocks
